In [1]:
import numpy as np

import pandas as pd

import matplotlib.pyplot as plt

from sklearn import datasets, linear_model

from sklearn.metrics import mean_squared_error

In [11]:
np.arange(0,15).reshape(5,3)

array([[ 0,  1,  2],
       [ 3,  4,  5],
       [ 6,  7,  8],
       [ 9, 10, 11],
       [12, 13, 14]])

In [12]:
pd.DataFrame(np.arange(0,15).reshape(5,3))

    0   1   2
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14

In [19]:
dd=pd.DataFrame(np.arange(0,15).reshape(5,3),index=["Row1","Row2","Row3","Row4","Row5"],columns=["First","Second","Third"])

In [21]:
dd.head(2)

      First  Second  Third
Row1      0       1      2
Row2      3       4      5

In [22]:
type(dd)

pandas.core.frame.DataFrame

In [23]:
dd.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Row1 to Row5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   First   5 non-null      int32
 1   Second  5 non-null      int32
 2   Third   5 non-null      int32
dtypes: int32(3)
memory usage: 100.0+ bytes

In [25]:
dd.describe()

           First     Second      Third
count   5.000000   5.000000   5.000000
mean    6.000000   7.000000   8.000000
std     4.743416   4.743416   4.743416
min     0.000000   1.000000   2.000000
25%     3.000000   4.000000   5.000000
50%     6.000000   7.000000   8.000000
75%     9.000000  10.000000  11.000000
max    12.000000  13.000000  14.000000

In [26]:
dd

      First  Second  Third
Row1      0       1      2
Row2      3       4      5
Row3      6       7      8
Row4      9      10     11
Row5     12      13     14

In [27]:
dd[["First","Second"]]    #Nested List for more than one coulmn

      First  Second
Row1      0       1
Row2      3       4
Row3      6       7
Row4      9      10
Row5     12      13

In [28]:
dd["First"]

Row1     0
Row2     3
Row3     6
Row4     9
Row5    12
Name: First, dtype: int32

In [29]:
type(dd["First"])

pandas.core.series.Series

In [31]:
dd.loc["Row1"]

First     0
Second    1
Third     2
Name: Row1, dtype: int32

In [35]:
dd.loc[["Row1","Row1"]]

      First  Second  Third
Row1      0       1      2
Row1      0       1      2

In [49]:
dd.values             #Converting to Array

array([[ 0,  1,  2],
       [ 3,  4,  5],
       [ 6,  7,  8],
       [ 9, 10, 11],
       [12, 13, 14]])

In [45]:
dd.iloc[0:3,1:3]   #selecting Roes and Columns

      Second  Third
Row1       1      2
Row2       4      5
Row3       7      8

In [48]:
dd.iloc[1:3,0:2]

      First  Second
Row2      3       4
Row3      6       7